In [3]:
import pandas as pd

In [4]:
olympic_data_list= {'Hostcity':['London','Beijing','Athens','Sydney','Atlanta'],
                    'Year':[2012,2008,2004,2000,1996],
                    'No. of participating countries':[205,204,201,200,197]
                   }

In [5]:
df_olympic_data = pd.DataFrame(olympic_data_list)
df_olympic_data

  Hostcity  Year  No. of participating countries
0   London  2012                             205
1  Beijing  2008                             204
2   Athens  2004                             201
3   Sydney  2000                             200
4  Atlanta  1996                             197

Create a dataframe using a dictionary

In [8]:
olympic_data_dict = {'London':{2012:205},'Beijing':{2008:204}}
df_olympic_data_dict = pd.DataFrame(olympic_data_dict)
df_olympic_data_dict

      London  Beijing
2012   205.0      NaN
2008     NaN    204.0

In [12]:
#View Dataframe

df_olympic_data.Hostcity

0     London
1    Beijing
2     Athens
3     Sydney
4    Atlanta
Name: Hostcity, dtype: object

In [11]:
df_olympic_data.describe

<bound method NDFrame.describe of   Hostcity  Year  No. of participating countries
0   London  2012                             205
1  Beijing  2008                             204
2   Athens  2004                             201
3   Sydney  2000                             200
4  Atlanta  1996                             197>

"""Creating Dataframe from dict of series """

In [32]:
olympic_series_participation = pd.Series(['205','204','201','200','197'],index=[2012,2008,2004,2000,1996])
olympic_series_country = pd.Series(['London','Beijing','Sydney','Atlanta','Athens'],index=[2012,2008,2004,2000,1996])

In [33]:
df_olympic_series=pd.DataFrame({'No. of participating countries':olympic_series_participation,
                                'Host cities':olympic_series_country})
df_olympic_series

     No. of participating countries Host cities
2012                            205      London
2008                            204     Beijing
2004                            201      Sydney
2000                            200     Atlanta
1996                            197      Athens

Create a dataframe using ndarray

In [21]:
import numpy as np

In [22]:
ndarray = np.array([2012,2008,2004,2006])
dictndarray = {'nd_year':ndarray}

In [23]:
df_ndarray = pd.DataFrame(dictndarray)
df_ndarray

   nd_year
0     2012
1     2008
2     2004
3     2006

In [24]:
#Daaframe from a dataframe
df_from_df = pd.DataFrame(df_ndarray)
df_from_df

   nd_year
0     2012
1     2008
2     2004
3     2006

#Pandas- View and Select Data

In [25]:
import numpy as np
import pandas as pd

In [26]:
colours = pd.Series(["red","orange","pink","purple","black"],index=[1,2,3,4,5])
fav = pd.Series(["kavya","pahal","yash","Amita","Vidit"])

In [30]:
df_series = pd.DataFrame({'colours are':colours,'favourite':fav})

In [31]:
df_series

  colours are favourite
0         NaN     kavya
1         red     pahal
2      orange      yash
3        pink     Amita
4      purple     Vidit
5       black       NaN

View data

In [34]:
df_series.describe

<bound method NDFrame.describe of   colours are favourite
0         NaN     kavya
1         red     pahal
2      orange      yash
3        pink     Amita
4      purple     Vidit
5       black       NaN>

In [35]:
#view top2 records

In [37]:
df_series.head(2)

  colours are favourite
0         NaN     kavya
1         red     pahal

In [38]:
#last 3 records
df_series.tail(3)

  colours are favourite
3        pink     Amita
4      purple     Vidit
5       black       NaN

In [41]:
#to view index
df_series.index

Int64Index([0, 1, 2, 3, 4, 5], dtype='int64')

In [42]:
#To view columns
df_series.columns

Index(['colours are', 'favourite'], dtype='object')

In [45]:
df_series['favourite']

0    kavya
1    pahal
2     yash
3    Amita
4    Vidit
5      NaN
Name: favourite, dtype: object

In [46]:
#select tablelocation based acess by label
df_series.loc[3]

colours are     pink
favourite      Amita
Name: 3, dtype: object

#integer location basedindexing 
df_series.iloc[0:2]

#integer location based data selection by index value

In [47]:
df_series.iat[3,1]

'Amita'

#select data by condtion

In [50]:
df_olympic_series[df_olympic_series['No. of participating countries']>200]

TypeError: '>' not supported between instances of 'str' and 'int'